docs/dev/nb.html
<!doctype html>
<html lang="en">
<head>
<title>nb</title>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="fh">

<link  href="../assets/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">nb</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Go</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">how to not use for loops</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<a href="https://softwareengineering.stackexchange.com/questions/314150/flow-control-in-go-without-a-for-loop">softwareengineering.stackexchange.com</a>: "use channels and goroutines"<br >
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">how to test when STDIN is involved</h3>
<div class="outline-text-3" id="text-1-2">
<p>
<a href="https://stackoverflow.com/questions/46365221/fill-os-stdin-for-function-that-reads-from-it">stackoverflow.com</a><br >
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">read multiple integers (without for loop)</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://stackoverflow.com/questions/39565055/read-a-set-of-integers-separated-by-space-in-golang">stackoverflow.com</a><br >
</p>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">go strings.NewReader()</h3>
<div class="outline-text-3" id="text-1-4">
<pre class="example">
curl -X POST -d @filename.txt http://example.com/path/to/resource --header "Content-Type:application/json"
</pre>

<p>
<a href="https://golang.org/pkg/fmt/#hdr-Scanning">https://golang.org/pkg/fmt/#hdr-Scanning</a><br >
</p>

<p>
I'm trying to mock stdin with an io.reader and see a difference in behaviour that I don't quite understand. Any input on this would be much appreciated!<br >
</p>

<p>
My input format is<br >
    single integer<br >
    x number of integers<br >
</p>

<p>
For example<br >
    4<br >
    1 2 3 4<br >
</p>

<p>
I read the first line using fmt.Fscanln(reader, &amp;singleInt). For the second line, I use fmt.Fscanf(reader, "%d", &amp;nextInteger) exactly x times. Now, when the reader is os.stdin, this works exactly as intended. However, when I try to mock stdin with a reader defined, for example as new<br >
</p>
</div>
</div>
</div>



<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Visual Studio Code setup</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">settings sync to synchronize settings between machines</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<a href="https://marketplace.visualstudio.com/items?itemName=Shan.code-settings-sync">marketplace.visualstudio.com</a><br >
</p>
<pre class="example">
1. Upload Key : Shift + Alt + U
2. Download Key : Shift + Alt + D
</pre>
</div>
</div>
</div>



<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">topics Yury mentioned</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Scrumm / Agile</h3>
<div class="outline-text-3" id="text-3-1">
<p>
German guy who wrote about Scrumm, APICs?<br >
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Python</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Generator, Decorator, &#x2026;<br >
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Git</h3>
<div class="outline-text-3" id="text-3-3">
<p>
rebase, force push, others<br >
</p>
</div>
</div>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">from applications</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1">REST/RPC APIs?</h3>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">from meet-up</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>load balancer<br >
</li>
<li>EC2 (Amazon)<br >
</li>
<li>REST API<br >
</li>
</ul>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">Go</a>
<ul class="nav">
<li><a href="#sec-1-1">how to not use for loops</a></li>
<li><a href="#sec-1-2">how to test when STDIN is involved</a></li>
<li><a href="#sec-1-3">read multiple integers (without for loop)</a></li>
<li><a href="#sec-1-4">go strings.NewReader()</a></li>
</ul>
</li>
<li><a href="#sec-2">Visual Studio Code setup</a>
<ul class="nav">
<li><a href="#sec-2-1">settings sync to synchronize settings between machines</a></li>
</ul>
</li>
<li><a href="#sec-3">topics Yury mentioned</a>
<ul class="nav">
<li><a href="#sec-3-1">Scrumm / Agile</a></li>
<li><a href="#sec-3-2">Python</a></li>
<li><a href="#sec-3-3">Git</a></li>
</ul>
</li>
<li><a href="#sec-4">from applications</a>
<ul class="nav">
<li><a href="#sec-4-1">REST/RPC APIs?</a></li>
</ul>
</li>
<li><a href="#sec-5">from meet-up</a></li>
</ul>
</div>
</nav>
</div></div></div>
</body>
</html>
